In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv("X_2D_arome_interp_2016.csv")

In [3]:
df1.head()

,Unnamed: 0,number_sta,time,valid_time,ws,p3031,u10,v10,t2m,d2m,r,tp,msl
0,0,86118001,2016-06-19,2016-06-19 00:00:00,2.360735,300.570129,2.031857,-1.197647,287.520206,284.392389,81.496266,NaN,102614.380009
1,1,86149001,2016-06-19,2016-06-19 00:00:00,2.059683,278.237361,2.036379,-0.298119,285.289130,283.076365,86.347620,NaN,102619.765078
2,2,56081003,2016-06-19,2016-06-19 00:00:00,2.586343,287.103175,2.467196,-0.757305,283.136152,281.679318,90.649944,NaN,102775.500604
3,3,53215001,2016-06-19,2016-06-19 00:00:00,1.873133,282.026020,1.828928,-0.390428,283.009130,282.154606,94.419616,NaN,102656.699157
4,4,22135001,2016-06-19,2016-06-19 00:00:00,1.197948,225.409073,0.868830,0.800126,282.722457,281.852696,94.300453,NaN,102742.146704

In [5]:
df1.columns

Index(['Unnamed: 0', 'number_sta', 'time', 'valid_time', 'ws', 'p3031', 'u10',
       'v10', 't2m', 'd2m', 'r', 'tp', 'msl'],
      dtype='object')

In [6]:
df2 = pd.read_csv("X_2D_arpege_interp_2016.csv")

In [7]:
df2.head()

,Unnamed: 0,number_sta,time,valid_time,ws,p3031,u10,v10,t2m,d2m,r,tp,msl
0,0,86118001,2016-06-20,2016-06-20 00:00:00,2.086929,233.253902,1.664778,1.237922,286.539573,283.093877,79.639350,NaN,102645.854404
1,1,86149001,2016-06-20,2016-06-20 00:00:00,2.185954,245.159387,1.981390,0.919149,286.938202,283.444309,79.446693,NaN,102617.579572
2,2,56081003,2016-06-20,2016-06-20 00:00:00,5.016007,214.343294,2.828977,4.141360,287.489841,286.992310,96.826972,NaN,102395.204634
3,3,53215001,2016-06-20,2016-06-20 00:00:00,3.881939,231.816313,3.050690,2.398041,288.434913,285.401914,82.119988,NaN,102512.548443
4,4,22135001,2016-06-20,2016-06-20 00:00:00,6.180966,207.710636,2.864924,5.468440,287.120840,286.291029,94.758836,NaN,102298.307549

In [8]:
df2.columns

Index(['Unnamed: 0', 'number_sta', 'time', 'valid_time', 'ws', 'p3031', 'u10',
       'v10', 't2m', 'd2m', 'r', 'tp', 'msl'],
      dtype='object')

In [10]:
df3 = pd.read_csv("X_station_train.csv")

In [11]:
df3.head()

,number_sta,date,ff,t,td,hu,dd,precip,Id
0,14066001,2016-01-01 00:00:00,3.05,279.28,277.97,91.4,200.0,0.0,14066001_0_0
1,14066001,2016-01-01 01:00:00,2.57,278.76,277.45,91.4,190.0,0.0,14066001_0_1
2,14066001,2016-01-01 02:00:00,2.26,278.27,277.02,91.7,181.0,0.0,14066001_0_2
3,14066001,2016-01-01 03:00:00,2.62,277.98,276.95,93.0,159.0,0.0,14066001_0_3
4,14066001,2016-01-01 04:00:00,2.99,277.32,276.72,95.9,171.0,0.0,14066001_0_4

In [12]:
df4 = pd.read_csv("Y_train.csv")

In [13]:
df4.head()

         date  number_sta  Ground_truth          Id
0  2016-01-02    14066001           3.4  14066001_0
1  2016-01-02    14126001           0.5  14126001_0
2  2016-01-02    14137001           3.4  14137001_0
3  2016-01-02    14216001           4.0  14216001_0
4  2016-01-02    14296001          13.3  14296001_0

In [19]:
df3[df3.Id=='414066001_0']

Empty DataFrame
Columns: [number_sta, date, ff, t, td, hu, dd, precip, Id]
Index: []